#pragma once
//=============================================================================
//
// リザルト画面処理 [Result.h]
// Author : 名和 遼汰朗
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_


#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
